# 7.1 Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[string_data.isnull()]

2    NaN
dtype: object

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [10]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[~data.isnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [16]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned = data.dropna()

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [21]:
data[4] = NA

In [22]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
df = pd.DataFrame(np.random.randn(7, 3))

In [25]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [26]:
df

          0         1         2
0 -0.702070       NaN       NaN
1 -2.558538       NaN       NaN
2  1.020534       NaN -0.539693
3 -0.121794       NaN -0.869586
4 -1.771484 -0.181591  1.926233
5 -0.554980  1.482943  0.726201
6 -0.380645  0.165552 -0.228297

In [27]:
df.dropna()

          0         1         2
4 -1.771484 -0.181591  1.926233
5 -0.554980  1.482943  0.726201
6 -0.380645  0.165552 -0.228297

In [28]:
df.dropna(thresh=2)

          0         1         2
2  1.020534       NaN -0.539693
3 -0.121794       NaN -0.869586
4 -1.771484 -0.181591  1.926233
5 -0.554980  1.482943  0.726201
6 -0.380645  0.165552 -0.228297

### Filling In Missing Data

In [29]:
df.fillna(0)

          0         1         2
0 -0.702070  0.000000  0.000000
1 -2.558538  0.000000  0.000000
2  1.020534  0.000000 -0.539693
3 -0.121794  0.000000 -0.869586
4 -1.771484 -0.181591  1.926233
5 -0.554980  1.482943  0.726201
6 -0.380645  0.165552 -0.228297

In [30]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.702070  0.500000  0.000000
1 -2.558538  0.500000  0.000000
2  1.020534  0.500000 -0.539693
3 -0.121794  0.500000 -0.869586
4 -1.771484 -0.181591  1.926233
5 -0.554980  1.482943  0.726201
6 -0.380645  0.165552 -0.228297

In [31]:
_ = df.fillna(0, inplace =True)

In [32]:
df

          0         1         2
0 -0.702070  0.000000  0.000000
1 -2.558538  0.000000  0.000000
2  1.020534  0.000000 -0.539693
3 -0.121794  0.000000 -0.869586
4 -1.771484 -0.181591  1.926233
5 -0.554980  1.482943  0.726201
6 -0.380645  0.165552 -0.228297

In [33]:
df = pd.DataFrame(np.random.randn(6, 3))

In [34]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -1.170639  1.836866 -0.317396
1  2.005098  1.705248 -0.697525
2 -0.722697       NaN  0.204655
3  0.708214       NaN  0.214451
4  0.565402       NaN       NaN
5  0.837567       NaN       NaN

In [35]:
df.fillna(method = 'ffill')

          0         1         2
0 -1.170639  1.836866 -0.317396
1  2.005098  1.705248 -0.697525
2 -0.722697  1.705248  0.204655
3  0.708214  1.705248  0.214451
4  0.565402  1.705248  0.214451
5  0.837567  1.705248  0.214451

In [36]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.170639  1.836866 -0.317396
1  2.005098  1.705248 -0.697525
2 -0.722697  1.705248  0.204655
3  0.708214  1.705248  0.214451
4  0.565402       NaN  0.214451
5  0.837567       NaN  0.214451

In [37]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [38]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64